Revit 2024 API
ParameterTypeId.DiameterSymbolLocation Property
 "Diameter Symbol Location"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId DiameterSymbolLocation { get; }
Visual Basic
Public Shared ReadOnly Property DiameterSymbolLocation As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ DiameterSymbolLocation {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace